[{"id":"1","name":"Aakriti Khurana","title":"Edible Plastic","description":"","website":"example.com","images":"Edible Plastic_z.jpg","typeface":"","notes":"Need description and images as individual files"},{"id":"2","name":"Adrian Shaughnessy","title":"Cutter","description":"","website":"example.com","images":"IMG_8746.jpeg","typeface":"","notes":""},{"id":"3","name":"Anastasia Arjalies","title":"Happysad","description":"This typeface was created during the 'Type Family' workshop lead by Radim Peško at the RCA. This was my first attempt at creating a typeface. Happysad was originally designed because I was looking for an original typeface to use on my website but none seemed appropriate to me. So I decided to design my own personal typeface by using my 'happysad' doodles to create an abstract shape which would end up in each of the letters. The idea was to create a playful typeface by using contrast between positive and negative spaces: the outside of each letter is made with very simple shapes but inside, the abstract shape is here to bring some more fun to the typeface. We can even find smilies in some letters but they are simply suggested.","website":"example.com","images":"ANASTASIA_ARJALIES_TS_1.jpg,ANASTASIA_ARJALIES_TS_2.jpg,ANASTASIA_ARJALIES_TS_3.jpg","typeface":"","notes":""},{"id":"4","name":"Bakhtawer Haider","title":"NASTA‘LĪQ","description":"If you were to travel through the streets of Lahore, you would see an abun-of Lahore, you would see an abun-dance of rikshahs, shops and buildings dance of rikshahs, shops and buildings covered with labels and signs. You will covered with labels and signs. You will find that those labels tend to be either find that those labels tend to be either in Urdu or in English. Whilst the Lat-in Urdu or in English. Whilst the Lat-in scripted signs display an expected in scripted signs display an expected cacophony of typographic choices, cacophony of typographic choices, arrangements and visual styles the cor-arrangements and visual styles the cor-responding Urdu signs seem to often responding Urdu signs seem to often be handpainted and use just the one be handpainted and use just the one typographic style. This style is called typographic style. This style is called Nasta‘līq — a Perso-Arabic script, de-Nasta‘līq — a Perso-Arabic script, de-scribed as delicate and ornate and al-scribed as delicate and ornate and al-ways sloping slightly downwards. ways sloping slightly downwards.","website":"example.com","images":"","typeface":"","notes":""},{"id":"5","name":"Betty Brunfaut","title":"BentonSustain","description":"I have developed the carved version of BentonSans, called BentonSustain as a more sustainable alternative to the original. It uses 33 percent less ink when printed as body text but can also be used for titles.  At the RCA the students shape the school, it then made complete sense to use the tools of the school, subvert them and hopefully encourage the institution to use these new and improved tools.  The method I used to carve the typeface is inspired by the Ryman Eco, who decribed their project as a “typeface that does not compromise legibility for sustainability but only helps the environment uses 33 percent less ink than standard fonts”. From my investigation around sustainable fonts, I started dreaming of a tool that could carve any typeface in different ways and thus save massive amounts of ink. This remains a speculative project for now but hopefully I can take it out of the speculative realm. ","website":"example.com","images":"","typeface":"benton","notes":""},{"id":"6","name":"Camille Le Flem","title":"Mihi Nili","description":"Mihi Nili is a display typeface designed during Radim Peško's workshop Type Family at the RCA.\n\nThe idea behind those quirky letters comes from the way I was feeling in an airplane this February: I was warm, sweaty, like melting. So I decided to 'glue' the bottom of the letters, and to fill spaces that are usually empty. I played with round shapes appearing in each letter, like drops on the characters.\n\nMihi Nili is an attempt to translate a sensation I've experienced through a system of letters.","website":"example.com","images":"Camille_LeFlem_TS.jpg,Camille_LeFlem_TS2.jpg,Camille_LeFlem_TS3.jpg,Camille_LeFlem_TS4.jpg,Camille_LeFlem_TS5.jpg,Camille_LeFlem_TS6.jpg","typeface":"","notes":""},{"id":"7","name":"Costas Kalogeropoulos","title":"Seymour","description":"","website":"example.com","images":"","typeface":"quintain","notes":""},{"id":"8","name":"Inès Iragui","title":"Typeface name","description":"","website":"example.com","images":"type-demo-04.jpg,type-demo-05.jpg,type-demo-06.jpg,type-demo-09.jpg","typeface":"","notes":""},{"id":"9","name":"Inès Iragui","title":"Morse code symbols","description":"CONCRETE = CEMENT + AGREGATE","website":"example.com","images":"","typeface":"","notes":""},{"id":"10","name":"Jin-Hoo Park","title":"ShinShin Women","description":"In Type Family, I developed my previous typeface design project named ‘ShinShin Women.’ ‘ShinShin Women’ is on the theme of ‘different evaluation on the same phenomenon’ with the material of ‘new women (shin-yeo-seong).’ I had designed a Korean typeface based on a Chinese typeface used in the cover of Shinyeoseong, a women’s magazine published in the\n1920s and 1930s.","website":"example.com","images":"","typeface":"","notes":""},{"id":"11","name":"Jose Garcia Oliva","title":"Greed","description":"Greed.\n\nType shaped by one of the world’s most underestimated of cultural assets: toilet roll.\nToilet paper has taught us an unexpected lesson about the human psyche in a situation of both fear and anxiety.\nThis context reveals forms of behaviour that look upon only and uniquely oneself. Hoarding/stockpiling is a transparent reaction\nthat portraits the lack of community-minded in both personal and national scale.\n\nThe typeface is meant to exist in a 3D scenario which allows the cycling movement of the toilet sheet that goes around the anchors.","website":"example.com","images":"","typeface":"","notes":""},{"id":"12","name":"Josh Trees, Yvan Martinez, Krister Olsson","title":"Public Foundry: (Towards a) manifesto for a (new) typography without typographers (v1.0)","description":"Public Foundry is the renegade child of Postconceptualism, Memetics and FLOSS.\nPublic Foundry calls for a (new) typography powered by the public and the machine, roused by the everyday interplay of information and language. Public Foundry calls for a practice\nof citizens, designers and machines intermixing to demystify and diversify the process of font design and distribution.\n\nPublic Foundry calls for a typographer-less type foundry that is fundamentally and unashamedly public.","website":"example.com","images":"","typeface":"","notes":""},{"id":"13","name":"Konstantina Benaki Chatzispasou","title":"Notation Symbols","description":"I got interested in the idea of trying to print my visual sign language, that comes from my way of taking notes. I thought that it would be interesting to separate text with symbols and examine them individually. This process inspired me to start thinking of language as a material. Thus, I experimented with laser-cut, using MDF board as my primary material. Observing the \"gesture\" of the two different writing processes (the physical and the technological), I noted a dialogue between them. A symbiosis, where one brings in life the ideas and the other one transforms them into 3D objects. ","website":"example.com","images":"02_Process.jpg,03_Process.jpg,04_Process.jpg,05_Process.jpg,06_Notation Symbols.jpg","typeface":"","notes":""},{"id":"14","name":"Magda Tritto","title":"Untitled WIP Typeface","description":"During the workshop Type Methods I developed this new typeface exploring the balance/not-balance between negative and positive space, their void and their tension.","website":"example.com","images":"","typeface":"","notes":""},{"id":"15","name":"Max Kohler","title":"Grid System","description":"A speculative font editor/design tool for modular letterforms. Letterforms are created by placing markers on a predefined grid. The system then replaces these markers with geometric shapes to make up the letterform, and exposes controls to transform the shapes and the underlying grid. This was done as part of and ongoing personal project experimenting with home-made design tools.","website":"maxkoehler.com","images":"Capture.PNG,Capture3.PNG,Capture4.PNG","typeface":"","notes":"interactive"},{"id":"16","name":"Maya Gulieva","title":"Xchronica 2020","description":"","website":"example.com","images":"Xronica2020.jpg,Xronica20202.jpg,Xronica20203.jpg,Xronica20204.jpg,Xronica20205.jpg,Xronica20206.jpg","typeface":"","notes":""},{"id":"17","name":"Maya Gulieva","title":"Neue Venera","description":"","website":"example.com","images":"A-C3.jpg,A-C4.jpg,A-C5.jpg,A-C6.jpg,A-C7.jpg,A-C8.jpg","typeface":"","notes":""},{"id":"18","name":"Melissa Berney","title":"Digital Clock","description":"","website":"example.com","images":"Meli_Berney_Meli_Berney_0.jpg,Meli_Berney_Meli_Berney_1.jpg,Meli_Berney_Meli_Berney_4.jpg,Meli_Berney_Meli_Berney_7.jpg,Meli_Berney_Meli_Berney_Type.jpg","typeface":"","notes":"interactive"},{"id":"19","name":"Minjeong Kim","title":"Frankenstein Unit","description":"In Shelley's novel, Dr Frankenstein collects bones from charnel houses to make a human lookalike creature. My project has begun with this methodology of Dr Frankenstein to create a new creature which looks like a human but not a perfect human.\nI have been working on the subject Frankenstein, inspired by Dr Frankenstein’s methodology on making an entirely new human look-alike creature by combining dead bodies collected from charnel houses. I found it interesting with the character of Frankenstein’s creature\nas an incomplete entity made by broken pieces of completeness. Frankenstein’s creature is not a natural creation of life, but a creation that did not turn out as expected. Dr Frankenstein thought that he had attached the whole human body to create complete life, and though\nhe(the creature) actually had a body that could think and even excels like a human being, Frankenstein’s creature regarded himself as an incomplete and miserable one. From this idea of complete incompleteness of Frankenstein’s creature, I have been made a few Frankenstein inspired typeface series for few years, which is made by collecting and combining free fonts over the website, with all the different typefaces in every single stroke with the methodology of Dr Frankenstein. As a continuing project of the Frankenstein series, I am experimenting to create a variable font, which can be partially divided and adjustable for each stroke.With 27 buttons of English keyboard, I made 27 units for the combinable, stackable stroke structure to build up complete one letter(or any kind of symbol). As shape and weight are adjustable for each unit, the whole sentence can be animated separately like it’s alive or it can be adjusted all together for a more refined look for display.","website":"example.com","images":"","typeface":"","notes":"Can we see cool variable fotn animation"},{"id":"20","name":"Richard Bevan","title":"Pocari Sweat","description":"One of the nice things about Tokyo is that there are vending machines on almost every corner. This is especially useful if you visit the city in the summer as I did in 2016. As a foreigner you have to somehow make a choice of which of these unfamiliar brands will best quench your thirst. Maybe you can’t read the characters of the language so you need to make the decision based on different criteria than you would at home.\nI found making this decision pretty easy. When looking at the available choices there was a drink called Pocari Sweat. The name sounds quite unappealing, but intriguing, a sweaty drink. Its packaging instantly stood out amongst the others. The can was a single shade of blue with a white swoosh, with the name vertically set in modern type. It seemed very clear. This is Pocari Sweat. The other drinks had decorations and illustrations that wanted to tell me something about their ingredients or tastes. I had no idea what Pocari Sweat was or how it would it taste. I choose the sweaty drink each time I used a vending machine during for the rest of the trip, this becoming an important part of my visit to Japan.\nMuch later I discovered that German designer Helmut Schmidt was responsible for the brand identity. I was pretty excited by this having been a fan of his work for a while. I think this says something about how design and typography communicate. Being spoken to by Schmidt across time and space in a completely different context to how I had previously experienced his work in history of design books.","website":"example.com","images":"","typeface":"","notes":"Needs twitch stream"},{"id":"21","name":"Roland Ross","title":"Ghost type","description":"","website":"example.com","images":"","typeface":"","notes":""},{"id":"22","name":"Sean Steed ","title":"Landscape","description":"","website":"example.com","images":"","typeface":"","notes":"video"},{"id":"","name":"Siddhi Gupta","title":"We cannot do art","description":"This was an experiment with non art educators in India, who were convinced they couldn’t draw. But when presented with dots that were labelled with the english alphabet, numbers and Hindi alphabet (all subjects they taught) they all joined them and before they realised themselves - they were drawing.\nI propose to use this joining the dot process to create a worksheet of the entire Hindi alphabet. Where, you join the dots labelled with the english alphabet but end up writing Hindi.","website":"example.com","images":"","typeface":"","notes":""},{"id":"23","name":"William Jacobson","title":"Shiznit","description":"Shiznit is an all-cap headline display typeface based on the lettering of the iconic hiphop album Doggystyle by Snoop Dogg, illustrated by Darry ’JoeCool’ Daniel in 1993.\nJoeCool speaks about the album art as being juxtapositioning inspirations such as innocence ‘Snoopy’ from Peanuts with the more explicit illustrations of George Clinton’s Atomic Dog. The Shiznit comes in a family of four: The Sharp, being the original \nadaptation, the Smooth alternative giving more of a mild flow and the Bricks together with a Rough style to celebrate its origin, which used as grid, the typface is also crafted upon.","website":"example.com","images":"","typeface":"","notes":""},{"id":"24","name":"Yangyang Zhang","title":"Ritual","description":"In this workshop, I not only design a typeface but also a unique language. My inspiration comes from the Chinese symbols, and Symbols usually employed in religious events. In areas of rural China, it is customary for families to invite a witch to hold an exorcism if memebers are suffering from illness.\nAs such, these symbols have special meaning that can only be understood and recognised by the initiated. I researched the visual structure and systems of these symbols and attempted to make my own in response.","website":"example.com","images":"","typeface":"","notes":""},{"id":"25","name":"Yehonatan Cohen","title":"Results Confidence","description":"With the growth rate of voice-user interfaces, I was intrigued by how confidence in personalities like Alexa or Siri was expressed.That's why I decided to use Google's voice recognition technology to create a web page that presents the level of confidence of a \"software\".When the user speaks up, if the \"software\" is fully confident that it has understood his words, it will write it in the yellow color. If it is not sure, it will write it in the blue color, so that eventually a color distribution of the software confidence level is obtained.","website":"example.com","images":"","typeface":"","notes":"interative"}]